# ProjectBrowserOptions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ProjectBrowserOptions Members
ProjectBrowserOptions Class Methods Properties See Also
---
The ProjectBrowserOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ProjectBrowserOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetProjectBrowserOptions | Returns the current Revit instance's ProjectBrowserOptions. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ShowViewPlacementOnSheetStatusIcons | Show the icons indicating view placement on sheet status. |

# See Also
ProjectBrowserOptions Class
Autodesk.Revit.UI Namespace